Table of Contents
 Class HangingAroundPatch
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representing of hanging hanging around patch load/support in IDEA StatiCa Detail
[OpenModelClass(typeof(Reinforcement))]
public class HangingAroundPatch : Reinforcement
Inheritance
object
OpenObject
OpenElementId
Reinforcement
HangingAroundPatch
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 HangingAroundPatch()
Constructor
public HangingAroundPatch()
Properties
 BottomPartLength
Length of bottom part
public double BottomPartLength { get; set; }
Property Value
double
 Diameter
Diameter o reinforcement
public double Diameter { get; set; }
Property Value
double
 DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
public double DiameterOfMandrel { get; set; }
Property Value
double
 DistanceFromPatch
Distance from patch support/load
public double DistanceFromPatch { get; set; }
Property Value
double
 EndsType
End type of the reinforcement bar - same for both ends
public LongReinfEndType EndsType { get; set; }
Property Value
LongReinfEndType
 InclinedPartsAngle
Inclination of inclined parts
public double InclinedPartsAngle { get; set; }
Property Value
double
 InclinedPartsLength
Length of inclined parts
public double InclinedPartsLength { get; set; }
Property Value
double
 IsMirrored
Add same reinforcement on oposide side (rotated 180°)
public bool IsMirrored { get; set; }
Property Value
bool
 LegsLength
Length of legs
public double LegsLength { get; set; }
Property Value
double
 MasterComponent
Master component of hanging
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 NumOfBarsInLayer
Number of bars in layer
public int NumOfBarsInLayer { get; set; }
Property Value
int
 Rotation
Angle of reinforcement rotation around patch point
public double Rotation { get; set; }
Property Value
double
 Edit this page